docs/results/simllm-saturated-throughput-warm-cache-20260717/enabled-warm-cache/warmup_pass_1.log
INFO 07-17 04:35:46 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 07-17 04:35:46 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 07-17 04:35:46 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
WARNING 07-17 04:35:46 [__init__.py:36] The vLLM package was not found, so its version could not be inspected. This may cause platform detection to fail.
INFO 07-17 04:35:46 [__init__.py:246] Platform plugin ascend is activated
INFO 07-17 04:35:46 [platform.py:60] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
/root/miniconda3/envs/vllm-hust-dev/lib/python3.11/site-packages/requests/__init__.py:92: RequestsDependencyWarning: Unable to find acceptable character detection dependency (chardet or charset_normalizer).
  warnings.warn(
ERROR 07-17 04:35:51 [config.py:29] Failed to import Triton kernels. Please make sure your triton version is compatible. Error: No module named 'triton.language.target_info'
Namespace(trust_remote_code=False, seed=0, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=32, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8021, endpoint='/v1/completions', header=None, max_concurrency=16, model='/data/shared_models/Qwen2.5-14B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/vllm-hust-benchmark/.benchmarks/simllm-saturated-throughput-warm-cache/enabled-warm-cache', result_filename='warmup_pass_1.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-92ecd9df-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-17 04:35:54 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [32, 32]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 190:21:30 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 32/32 [00:35<00:00,  1.11s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Maximum request concurrency:             16        
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  35.46     
Total input tokens:                      131072    
Total generated tokens:                  1024      
Request throughput (req/s):              0.90      
Output token throughput (tok/s):         28.87     
Peak output token throughput (tok/s):    101.00    
Peak concurrent requests:                11.00     
Total token throughput (tok/s):          3724.73   
---------------Time to First Token----------------
Mean TTFT (ms):                          1377.36   
Median TTFT (ms):                        1317.87   
P99 TTFT (ms):                           3240.64   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          147.71    
Median TPOT (ms):                        145.06    
P99 TPOT (ms):                           226.98    
---------------Inter-token Latency----------------
Mean ITL (ms):                           147.71    
Median ITL (ms):                         87.12     
P99 ITL (ms):                            592.02    
==================================================